---
kind: method
id: M:Autodesk.Revit.DB.ThermalAsset.Copy
zh: 复制
source: html/2d33b739-3651-4144-e2d2-056063209e7a.htm
---
# Autodesk.Revit.DB.ThermalAsset.Copy Method

**中文**: 复制

Produces a copy of the asset.

## Syntax (C#)
```csharp
public ThermalAsset Copy()
```

## Returns
A copy of the asset.